tsutsui/netbsd-cobalt-restorecd/data/cobalt/install/files/usr/share/man/man8/paneld.8
.\" $NetBSD$
.\"
.\" Copyright (c) 2003 Dennis I. Chernoivanov
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 2, 2003
.Dt PANELD 8
.Os
.Sh NAME
.Nm paneld
.Nd menu daemon for LCD screens
.Sh SYNOPSIS
.Nm paneld
.Op Fl d
.Op Fl f Ar conffile
.Sh DESCRIPTION
.Nm
allows to manage device by means of menu displayed on the screen. The daemon
merely parses its configuration file, creates menu hierarchy and then executes
external commands in response to user interactions.
.Sh FILES
.Bl -tag -width "/etc/paneld.conf    "
.It /etc/paneld.conf
.Xr paneld 8
configuration file
.El
.Sh SEE ALSO
.Xr paneld.conf 5
.\" .Sh SECURITY CONSIDERATIONS
